#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.log_analytics_workspace.random_uuid.telemetry[0]: Refreshing state... [id=95f09b6f-b3d1-d0c7-1969-1bf6eb79264a]
module.resource_group.random_uuid.telemetry[0]: Refreshing state... [id=405f479e-6845-d3e5-ff6c-77231f52d77d]
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.data.modtm_module_source.telemetry[0]: Reading...
module.resource_group.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.log_analytics_workspace.data.modtm_module_source.telemetry[0]: Read complete after 0s
module.resource_group.data.azurerm_subscription.current: Reading...
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.data.azurerm_client_config.telemetry[0]: Reading...
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev]
module.resource_group.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.log_analytics_workspace.data.azurerm_client_config.telemetry[0]: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wOTM4MGUyMC1iYzE5LTQ3NzItYWJhMC03NDZiN2ZmZmM0MzI7b2JqZWN0SWQ9NmE0NWNlMTQtOWVlZS00MjNiLWExN2UtNGY4ODBjOGVhZWNjO3N1YnNjcmlwdGlvbklkPTFhYjVkYzg5LTYwM2MtNGY0NS1iZGQxLWE0MjMxMzY5YjQwMDt0ZW5hbnRJZD1kYTFhYTc0NC1mNDNkLTQ2ZmQtODMwOC01YTNmNmI5OTQ1MmE=]
module.resource_group.modtm_telemetry.telemetry[0]: Refreshing state... [id=f982df00-7cc2-4fe3-a34f-4e97d500e2ce]
module.log_analytics_workspace.modtm_telemetry.telemetry[0]: Refreshing state... [id=8ee01287-a949-48f2-a15c-3891c494a8fa]
module.resource_group.data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400]
module.log_analytics_workspace.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab--demo-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.log_analytics_workspace.azurerm_log_analytics_workspace.this has changed
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                                      = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab--demo-dev"
        name                                    = "law-crv-githublab--demo-dev"
      + tags                                    = {}
        # (15 unchanged attributes hidden)
    }

  # module.resource_group.azurerm_resource_group.this has changed
  ~ resource "azurerm_resource_group" "this" {
        id         = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev"
        name       = "rg-crv-githublab-demo-dev"
      + tags       = {}
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.log_analytics_workspace.azurerm_log_analytics_workspace.this must be replaced
-/+ resource "azurerm_log_analytics_workspace" "this" {
      - cmk_for_query_forced                    = false -> null
      ~ id                                      = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab--demo-dev" -> (known after apply)
      - immediate_data_purge_on_30_days_enabled = false -> null
      ~ name                                    = "law-crv-githublab--demo-dev" -> "law-crv-githublab-demo-dev" # forces replacement
      ~ primary_shared_key                      = (sensitive value)
      ~ retention_in_days                       = 30 -> (known after apply)
      ~ secondary_shared_key                    = (sensitive value)
      ~ sku                                     = "PerGB2018" -> (known after apply)
      - tags                                    = {} -> null
      ~ workspace_id                            = "505e6a21-bdd3-4d18-8688-aeb175bee282" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ resource_ids   = {
      ~ log_analytics_workspace = "/subscriptions/1ab5dc89-603c-4f45-bdd1-a4231369b400/resourceGroups/rg-crv-githublab-demo-dev/providers/Microsoft.OperationalInsights/workspaces/law-crv-githublab--demo-dev" -> (known after apply)
        # (1 unchanged attribute hidden)
    }
  ~ resource_names = {
      ~ log_analytics_workspace_name = "law-crv-githublab--demo-dev" -> "law-crv-githublab-demo-dev"
        # (1 unchanged attribute hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @ch-rob, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*